{"title": "Martha's brioche buns", "tags": null, "planning": {"prep_time": "PT30 minutes + provingM", "cook_time": "PT20M", "total_time": "PT45-50 minutes + provingM", "serves": "10 rolls"}, "ingredients": [{"item": "\u0007100ml milk"}, {"item": "\u0007500g strong white bread flour, plus extra for dusting"}, {"item": "\u000750g butter, cut into cubes"}, {"item": "\u000725g caster sugar"}, {"item": "\u00071 tsp salt"}, {"item": "\u00077g sachet fast action dried yeast"}, {"item": "\u00071 British Blacktail Medium Free Range Egg, beaten"}, {"item": "\u0007Oil, for greasing"}, {"item": "For the glaze"}, {"item": "\u00071 British Blacktail Medium Free Range Egg, beaten"}, {"item": "\u00071 tbsp sesame seeds, if using"}], "instructions": [{"step": "1. Gently heat the milk and 175ml water in a small pan  until it is warm to the touch (don’t allow it to boil), then remove from the heat.\n\n2. In the bowl of a stand mixer, combine the flour and cubes of butter. Use your fingertips to rub the butter into the flour until you have a sandy texture with no large lumps of butter remaining. \n\n3. Stir in the sugar, salt and yeast and make a well in the centre. Pour in the beaten egg with ½ of the milk mixture.\n\n4. Using the dough hook attachment of the stand mixer, stir the dough, gradually incorporating the dry ingredients into the wet. Add the remaining liquid, mixing continuously, to form a soft, sticky dough. The dough will be quite wet, but this is a characteristic of brioche dough.\n\n5. Knead the dough in the bowl for 5 minutes until it starts to become smoother, then tip out onto a lightly floured surface and continue kneading for a further 5 minutes, adding an extra dusting of flour where needed. It will remain quite wet, but should become stretchy and smooth. Or, knead for 8-10 minutes using a stand mixer.\n\n6. Lightly oil a large bowl and place the dough into it. Cover and leave to rise for 1-2 hours or until doubled in size.\n\n7. When the dough has risen, knock it back, then tip out onto a flour-dusted surface. Divide into 10 equal pieces, shape each one into a ball and place onto two flour-dusted baking trays, leaving space between each roll for them to double in size comfortably.\n\n8. Cover the dough with a clean tea towel and leave to prove for 45-60 minutes or until almost doubled in size. About 15 minutes before they are ready, preheat the oven to 180ºC, gas mark 4 with a baking tray (at least 1cm deep) on the bottom of the oven.\n\n9. Glaze the rolls with egg wash and sprinkle with seeds, if using. Pour a mugful of water into the hot, preheated baking tray for steam, and bake the rolls on the shelf above for 15-20 minutes, until golden and cooked through.\n\n10. Cool for 5 minutes on the tray, then transfer onto a rack to cool completely. Any crust that has formed will soften as they cool, making them perfect to load up with pulled pork, burgers or any other favourite fillings. The rolls will keep for up to 3 days in an airtight container but are best enjoyed on the day they are made."}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/m/Martha-Brioche-Buns.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}