{"title": "Ching-He Huang’s  Steamed wined chicken with orange & ginger dressing", "tags": null, "planning": {"prep_time": null, "cook_time": null, "total_time": null, "serves": "2"}, "ingredients": [{"item": "Ingredients "}, {"item": "For the chicken:"}, {"item": "4 boneless chicken thighs, skin removed "}, {"item": "2 tbsp Shaoxing rice wine "}, {"item": "2.5cm piece ginger, peeled and sliced into matchsticks"}, {"item": "1 large salad onion, sliced lengthways"}, {"item": " 2 handfuls baby spinach"}, {"item": "For the dressing:"}, {"item": "1 tbsp light soy sauce"}, {"item": " 1 tsp toasted sesame oil "}, {"item": "2 cloves garlic, finely chopped "}, {"item": "2.5cm piece root ginger, peeled and finely grated"}, {"item": "1 medium red chilli, seeds removed and finely chopped"}, {"item": "4 tbsp olive oil "}, {"item": "2 tbsp lime juice"}, {"item": " 1 pinch of brown sugar"}, {"item": "For garnish:"}, {"item": "1/2 orange, cut into segments "}, {"item": "1 salad onion, finely sliced lengthways"}], "instructions": [{"step": "1. For the chicken: place the chicken in a heatproof bowl (that can fit inside a steamer) and drizzle with the rice wine. Place the ginger matchsticks on top of the chicken, season with salt and drape over the spring onion."}, {"step": "2. Place the bowl in a bamboo steamer, cover with a lid and steam over a pan of simmering water (making sure the water does not touch the base of the steamer) for 15-20 minutes (depending on the size of the thighs), or until the chicken is cooked through. Check the water level during the cooking and top up with boiling water if necessary."}, {"step": "3. For the sour and spicy dressing: place all of the dressing ingredients into a bowl and stir to combine."}, {"step": "4. Remove the bowl of chicken from the steamer. Pour any of the cooking juices into another bowl and set aside. Transfer the chicken to a chopping board and chop into long rectangular chunks."}, {"step": "5. Place a layer of baby spinach and pea shoots on two serving plates and top with the chicken pieces. Garnish with orange segments and spring onion. Add two tablespoons of the reserved chicken juices to the dressing and mix well, then drizzle the dressing generously over the chicken."}, {"step": null}], "nutrition": null, "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Ching.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"}