{
   "title": "Martha's chocolate & pomegranate layer cake",
   "tags": null,
   "planning": {
      "prep_time": "PT20 minutes, plus 1 hour chilling timeM",
      "cook_time": "PT20-25 minutesM",
      "total_time": "PT40-45 minutes, plus 1 hour chilling timeM",
      "serves": "1 cake"
   },
   "ingredients": [
      {
         "item": "200g plain flour"
      },
      {
         "item": "70g cocoa powder"
      },
      {
         "item": "1 tsp bicarbonate of soda"
      },
      {
         "item": "1 tsp baking powder"
      },
      {
         "item": "¼ tsp salt"
      },
      {
         "item": "120ml sunflower oil (any unflavoured oil will do)"
      },
      {
         "item": "340g caster sugar"
      },
      {
         "item": "2 medium Waitrose British Blacktail Free Range Eggs"
      },
      {
         "item": "200ml pomegranate juice"
      },
      {
         "item": "For the ganache:"
      },
      {
         "item": "200g butter"
      },
      {
         "item": "280g dark chocolate (60-70% cocoa solids), chopped"
      },
      {
         "item": "2 tbsp golden syrup"
      },
      {
         "item": "250ml double cream"
      },
      {
         "item": "110g pack pomegranate seeds, to decorate (find in the chiller)"
      },
      {
         "item": ""
      }
   ],
   "instructions": [
      {
         "step": "1. Preheat the oven to 180°C, gas \nmark 4. Grease and line the bases of \n3 x 20cm tins with baking parchment."
      },
      {
         "step": "2. Combine the flour, cocoa powder, bicarbonate of soda, baking powder and salt together in a bowl. In a separate bowl, whisk together the oil, sugar and eggs until smooth."
      },
      {
         "step": "3. Add the pomegranate juice and the flour mixture to the oil, sugar and egg mixture. Pour in half the juice, and then add half the flour, then the remaining juice and the remaining flour. Make sure you mix well after each addition to avoid any lumps."
      },
      {
         "step": "4. Divide the mixture between the 3 tins and bake in the preheated oven for 20-25 minutes, or until the cakes are springy to touch and, when inserted, a skewer comes out clean. Leave to cool in the tins for 10 minutes, then transfer to a wire rack to cool completely."
      },
      {
         "step": "5. For the ganache, place the butter, chocolate and golden syrup into a heatproof bowl over a pan of boiling water. Stir until the mixture is melted and smooth – about 7-8 minutes. Pour in the double cream and mix until combined, then place into the fridge and chill until cool but not \nset – about 35-40 minutes. Use an electric hand whisk to whip the ganache until it turns from dark to pale brown – about 2-3 minutes.\n\n6. When you are ready to assemble the cake, place one layer of the sponge on to a plate and spread with quarter of the ganache. Top with the second layer of sponge and another quarter of the ganache, then add the final layer of sponge. Crumb coat the top and sides of the completed cake with a thin layer of ganache, then place in the fridge for around 30 minutes to set. Cover the cake with the remaining ganache and then top with the pomegranate seeds."
      }
   ],
   "nutrition": {
      "Energy": "2,869kJ 689kcals",
      "Fat": "45.8g",
      "Saturated Fat": "23.6g",
      "Carbohydrate": "62.7g",
      "Sugars": "45.6g",
      "Protein": "6.4g",
      "Salt": "0.9g",
      "Fibre": "2g"
   },
   "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/c/Martha---Choco-&-pomegranate-layer-cake-WEB.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"
}