{
   "title": "Sausage and fennel stuffed tomatoes",
   "tags": null,
   "planning": {
      "prep_time": null,
      "cook_time": null,
      "total_time": null,
      "serves": "4"
   },
   "ingredients": [
      {
         "item": "4 Jack Hawkins tomatoes"
      },
      {
         "item": "2½ tbsp olive oil"
      },
      {
         "item": "2 garlic cloves, finely chopped"
      },
      {
         "item": "200g sausages (3 large), meat squeezed out of the skins"
      },
      {
         "item": "½ tsp fennel seeds, crushed"
      },
      {
         "item": "pinch chilli flakes"
      },
      {
         "item": "150ml white wine"
      },
      {
         "item": "50g white bread (we used sourdough), torn into small pieces"
      },
      {
         "item": "125g ball mozzarella, torn into small pieces"
      }
   ],
   "instructions": [
      {
         "step": "1 Preheat the oven to 200˚C, gas mark 6. Slice off the tops of the tomatoes and use a teaspoon to scoop out all the pulp (reserve to use in another dish; see below). Put the tomatoes in a snug roasting tin or baking dish with the cut side facing up."
      },
      {
         "step": "2 Heat 2 tbsp oil in a large frying pan over a medium heat. Add the garlic then, after 1 minute, add the sausage meat, breaking it up with a wooden spoon. Add the fennel seeds and chilli flakes; fry the mixture for 8-10 minutes, until golden, stirring and breaking up the whole time. Add the wine and cook until mostly reduced; there should be just a little liquid in the pan. Stir in the torn-up bread and mozzarella; season and remove from the heat. Divide the mixture between the tomatoes and drizzle everything with the remaining ½ tbsp oil. Bake for 30 minutes, until soft and bubbling. Leave for 5 minutes before serving with a green salad or wholegrain rice, if liked."
      }
   ],
   "nutrition": {
      "Energy": "1,754kJ 422kcals",
      "Fat": "27g",
      "Saturated Fat": "10g",
      "Carbohydrate": "18g",
      "Sugars": "7g",
      "Protein": "16g",
      "Salt": "1.2g",
      "Fibre": "3.6g"
   },
   "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/s/200225_01B_StuffedToms.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"
}