{
  "title": "Spinach & feta filo pie",
  "tags": null,
  "planning": {
    "prep_time": "PT25 minutes, plus restingM",
    "cook_time": "PT50 minutesM",
    "total_time": null,
    "serves": "6"
  },
  "ingredients": [
    {
      "item": "3 tbsp extra virgin olive oil"
    },
    {
      "item": "1 red onion, halved and thinly sliced"
    },
    {
      "item": "3 garlic cloves, finely sliced"
    },
    {
      "item": "3 x 260g packs Essential Spinach, washed"
    },
    {
      "item": "100g Greek natural strained yogurt"
    },
    {
      "item": "200g feta, crumbled"
    },
    {
      "item": "3 salad onions, trimmed and finely sliced"
    },
    {
      "item": "1 unwaxed lemon, zest"
    },
    {
      "item": "1⁄2 x 20g pack dill, roughly chopped"
    },
    {
      "item": "2 medium British Blacktail Free Range Eggs, beaten"
    },
    {
      "item": "270g pack filo pastry"
    },
    {
      "item": "1⁄2 tsp sesame seeds"
    }
  ],
  "instructions": [
    {
      "step": "1.Preheat the oven to 200 ̊C, gas mark 6. Heat 1 tbsp oil in a saucepan and sweat the onion and garlic with a pinch of salt over a medium heat for 6-8 minutes until soft. Meanwhile, put the spinach in your largest mixing bowl (you may need to do this in batches) and pour over a kettle of just-boiled water, to wilt. Drain and refresh under cold water, then squeeze out the excess water and pat dry on kitchen paper."
    },
    {
      "step": "2. Roughly chop the spinach and mix together with the sautéed onion and garlic, yogurt, feta, salad onions, lemon zest, dill, eggs and a grind of black pepper. Lay the filo sheets on the work surface and cover with a clean, damp tea towel."
    },
    {
      "step": "Brush a little of the remaining 2 tbsp oil over the base and sides of an ovenproof baking dish roughly 20cm x 25cm."
    },
    {
      "step": "3.To assemble the pie, brush 3 sheets of filo with oil and gently lay them on top of each other in the base of the dish. Evenly spoon in the spinach and feta filling. Cut the remaining 4 sheets of filo so they just fit snugly on top of the filling. Brush them with oil and gently layer over the filling. Fold any overhanging pastry from the base over the top (trimming any excess) and brush all over with oil."
    },
    {
      "step": "Sprinkle with the sesame seeds and bake for 30-40 minutes until golden and crisp. Rest for 10 minutes before serving."
    }
  ],
  "nutrition": {
    "Energy": "1,518kJ 368kcals",
    "Fat": "19g",
    "Saturated Fat": "7.8g",
    "Carbohydrate": "30g",
    "Sugars": "4.8g",
    "Protein": "16g",
    "Salt": "1.5g",
    "Fibre": "3.1fibre"
  },
  "image_url": "//d1v30bmd12dhid.cloudfront.net/static/version6/content/dam/waitrose/recipes/images/4678-March-Recipe-Cards-Assets-400x400-filp.jpg/_jcr_content/renditions/cq5dam.thumbnail.400.400.png"
}